const cohereMessage = (numLocations: number, country: string, city: string) =>
  `یک آرایه JSON از ${numLocations} جاذبه گردشگری در ${country} ایجاد کنید${
    city ? `, به طور خاص در ${city}` : ``
  }. هر شیء در آرایه باید ویژگی‌های زیر را به زبان فارسی داشته باشد (لطفا توجه داشته باشید که فقط باید از کلمات فارسی استفاده کنید):

- \"شهر\" (رشته): شهری که جاذبه گردشگری در آن واقع شده است. اگر شهر خاصی مشخص نشده است، یک شهر مناسب در ${country} را انتخاب کنید.

- \"شهر_در_زبان_محلی\" (رشته): نام شهر به زبان محلی (مثال: \"وارشو\" برای ورشو)

- \"کشور_در_زبان_محلی\" (رشته): نام کشور به زبان محلی (مثال: \"پولسکا\" برای لهستان)

- \"نام_مکان\" (رشته): نام جاذبه گردشگری

- \"نام_در_زبان_محلی\" (رشته): نام جاذبه گردشگری به زبان محلی

- \"آدرس\" (رشته): آدرس دقیق جاذبه گردشگری

- \"موقعیت_جغرافیایی\" (رشته): موقعیت جغرافیایی (عرض جغرافیایی و طول جغرافیایی) جاذبه گردشگری

- \"توضیحات\" (رشته): توضیحی کوتاه در مورد این جاذبه گردشگری با حداقل 50 کاراکتر

- \"زمان_تقریبی_لازم\" (عدد): زمان تقریبی بازدید از این مکان به دقیقه

- \"انرژی_تقریبی_لازم\" (رشته): میزان انرژی لازم برای بازدید از این جاذبه گردشگری. یکی از موارد زیر را انتخاب کنید: \"بسیار کم\"، \"کم\"، \"متوسط\"، \"زیاد\"، \"بسیار زیاد\"

- \"میزان_شهرت\" (رشته): میزان شهرت جاذبه گردشگری. یکی از موارد زیر را انتخاب کنید: \"کم\"، \"متوسط\"، \"زیاد\"

- \"مناسب_خانواده\" (رشته): آیا این مکان برای خانواده مناسب است؟ \"بله\" یا \"خیر\"

- \"مناسب_کودکان\" (رشته): آیا این مکان برای کودکان مناسب است؟ \"بله\" یا \"خیر\"

- \"فقط_آقایان\" (رشته): آیا این مکان مخصوص آقایان است؟ \"بله\" یا \"خیر\"

- \"فقط_بانوان\" (رشته): آیا این مکان مخصوص بانوان است؟ \"بله\" یا \"خیر\"

- \"دسته_بندی\" (رشته): دسته‌بندی جاذبه گردشگری. یکی از موارد زیر را انتخاب کنید: \"رستوران\"، \"طبیعت\"، \"خرید\"، \"مذهبی\"، \"فرهنگی-هنری\"، \"تاریخی\"، \"ماجراجویی\"

- \"ساعات_کاری\" (رشته): ساعات کاری جاذبه گردشگری

- \"اطلاعات_تماس\" (رشته): اطلاعات تماس شامل شماره تلفن، ایمیل و وبسایت

- \"کلمات_کلیدی\" (آرایه‌ای از دقیقا 5 رشته): برچسب‌هایی که جاذبه گردشگری را دسته‌بندی می‌کنند. از دسته‌بندی‌های زیر استفاده کنید و آنها را به فارسی ترجمه نمایید:

#مذهبی
#طبیعت
#تاریخی
#فرهنگی
#مدرن
#معماری
#هنر
#غذا
#خرید
#سرگرمی
#ورزشی
#آموزشی
#منظره
#ماجراجویی

لطفا مطمئن شوید که برچسب‌ها با جاذبه گردشگری خاصی که توصیف می‌کنید مرتبط هستند و دسته‌بندی مناسبی را ارائه می‌دهند.`;

export default cohereMessage;
